<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Affinity Publisher 2.</string>
	<key>Identifier</key>
	<string>at.bwm..download.AffinityPublisher2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Affinity Publisher 2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://d1gl0nrskhax8d.cloudfront.net/macos/publisher2/2.0.0/affinity-publisher-2.0.0.dmg?Expires=1670000509&amp;Signature=lFEqp35G8gbP4EhogXrTNGrXB06OG7nYBLL4ftVn3AWY4QyAnshkKTXWj7RCLnDX1jxxt4~0jLed4QuklU9m4OtkMaKUR0~rvFj4IwwaNpE9lWOildmlaMKgiEIEdFN2T6JAhvedg9DN7O2KGW6TAO8QlXPdgl~TFocFu7ti1yHNpmyB0mPY2UAd40q2mdh7BD-oHqEQr6zwJpRbd8F79e4hjnot2uDYogK3f4uxqsFwsbT5RJgpvWZiufA1CvoP974OdFymiTlHlvDJi3LBVQVq8a2PBSSAVxxPOk65oZ22iIRIkijq-I9PTy4i27NHXWPMbOoOiSE8S~Nv4GZ1OA__&amp;Key-Pair-Id=APKAIMMPYSI7GSVTEAAQ</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Affinity Publisher 2.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.seriflabs.affinitypublisher2" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6LVTQB9699")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Affinity Publisher 2.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
