<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Affinity Publisher 2.</string>
	<key>Identifier</key>
	<string>at.bwm.download.AffinityPublisher2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Affinity Publisher 2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://d1gl0nrskhax8d.cloudfront.net/macos/publisher2/2.0.4/affinity-publisher-2.0.4.dmg?Expires=1675084502&amp;Signature=dkrCeBR0cCd7wSktrbUh8oCb29L4KMXArrlNFhR5RNDlXHW9axH-3SxRxN6PRcj4SpV8otPwtZ1z5c0kAX69vzv-foUwXl8V6QaNbNNIVEt1QIu8DxKo0N2dh4M8y7RKFGbMqZtUOH~QVZrQ0WpbXKcvmSlmeCi959HlElMAAKVDxKRJ5Uh8NdBVqgZJnwIxUU9Yy6YVZXVo62GOemDDKLbPi774evYt9CVCLOSoqbkQB-nkDBcMhczfvq3GUfeaHwCQQH3CRE0QMKgkbOis1s038HFhuDSj4eAhNmj46Dx8S9RllrUp1ZYTVWNnvhufJctdKIpv3zI4M7AuQMtK~w__&amp;Key-Pair-Id=APKAIMMPYSI7GSVTEAAQ</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Affinity Publisher 2.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.seriflabs.affinitypublisher2" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6LVTQB9699")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Affinity Publisher 2.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
