<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Affinity Photo 2.</string>
	<key>Identifier</key>
	<string>at.bwm..download.AffinityPhoto2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Affinity Photo 2</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://d1gl0nrskhax8d.cloudfront.net/macos/photo2/2.0.0/affinity-photo-2.0.0.dmg?Expires=1670000673&amp;Signature=kUL1XBr4H3U6UE05eI6cLckTCfIrKxmOVTYT6~W7EKAj4Yx4W3-aprIBPwL-CDMw95PgxXrOcOsh8WQOHFlRbx4sLYrlJF0WfG6njNhjiSzUB1qw2fY456oOlP5gI1KWD557VF~XbJUeR0vk1nAqX8qBTW-UD1qDhU6ptbx3EzupdKjVxD-bZpXEyHOn5~Dm04j-l0A1C1hzF6g5bO5-37kBRcUDiY7Y1LSKowWGzCiZ3B76Vfkh7OGf0OWCTmwxSRj4ylpQvJGhjV~sWuhqvvp4kK7M7-UpOCHn34GeMvJmFf-1V8BAZ-5KXxa1BzScV2MLzq8x0Ehp9zKYMyVRzw__&amp;Key-Pair-Id=APKAIMMPYSI7GSVTEAAQ</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Affinity Photo 2.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.seriflabs.affinityphoto2" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "6LVTQB9699")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Affinity Photo 2.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
